package io.dentall.totoro.business.service.nhi.util;

public enum NhiRuleCheckFormat {
    // 89009C: 曾申報 90007C(來源-110/01/01)，不得再報 89009C
    D1_1("%s: 曾申報 %s(%s-%s)，不得再報 %s"),

    // 91004C:  91015C(來源-110/01/01) 90天內不得申報 91004C。
    D1_2("%s:  %s(%s-%s) %s 天內不得申報 %s"),

    // 90012C:  37 已申報 92013C(來源-110/01/01)
    D1_3("%s:  %s 已申報 %s(%s-%s)"),

    // 91022C: 需在 91021C (來源-110/01/01) 申報 152 天內
    D1_4("%s: 需在 %s(%s-%s) 申報 %s 天內"),

    // 34004C: 每人限給付一次(含跨院所) (來源-110/01/01)
    D2_1("%s: 每人限給付一次(含跨院所) (%s-%s)"),

    // 92050C: 每人限給付一次 (來源-110/01/01)
    D2_2("%s: 每人限給付一次 (%s-%s) "),

    // 92059C: 每位醫師限給付一次 (來源-110/01/01)
    D2_3("%s: 每位醫師限給付一次 (%s-%s) "),

    // 81: 須未滿六歲
    D3_1("%s: 須%s"),

    // 81: 已於 來源-110/01/01 申報。
    D4_1("%s: 已於 %s-%s 申報"),

    // 91001C: 已於 來源-110/01/05 申報第一象限。
    D4_2("%s: 已於 %s-%s 申報%s"),

    // 91001C: 申報次數已達本月上限。(110/01/01, 110/01/03)
    D5_1("%s: 申報次數已達本月上限。(%s)"),

    // 91003C、91004C、91005C、91017C、91103C、91104C 不得同日申報
    D6_1("%s 不得同日申報"),

    // 91003C: 180 天內曾申報(來源-110/01/01) ，就醫類別請選 AB
    D7_1("%s: %s 內已申報 %s (%s-%s) 的 %s , 就醫類別請選 AB"),

    // 91003C: 91004C(來源-110/01/01) 180 天內申報 91003C(110/01/03、 110/01/04) 核刪機率高
    W1_1("%s: %s(%s-%s) %s 天內申報 %s(%s) 核刪機率高"),

    // 需併同 91003C/91004C/91020C 申報
    W3_1("需併同 %s 申報"),

    // 90012C: 須檢附影像
    XRAY("%s: 須檢附影像")
    ;

    private String format;

    NhiRuleCheckFormat(String format) {
        this.format = format;
    }

    public String getFormat() {
        return format;
    }
}
