@metric @meta
Feature: 每日申報件數 有卡號＋異常代碼之處置單數量總和

    Scenario: 計算IC3每日申報件數 (CardNumber為數字)
        Given 設定指標主體類型為醫師 Stan
        Given 設定病人 Jerry 24 歲
        Given 設定病人 Danny 24 歲
        Given 設定病人 Jun 24 歲
        When 設定指標資料
            | DisposalId | DisposalDate | ExamCode | ExamPoint | Code   | Point | OriginPoint | Tooth | Surface | SpecificCode | CardNumber | NhiCategory | PatientName | PartialBurden | PatientIdentity | SerialNumber |
            |            | 2020-05-01   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | 001        |             | Jerry       | 50            |                 |              |
            | 1          | 2020-05-02   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | 001        |             | Danny       | 50            |                 |              |
            | 1          | 2020-05-02   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | 001        |             | Danny       | 50            |                 |              |
            |            | 2020-05-13   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | 001        |             | Jun         | 50            |                 |              |
            |            | 2020-05-13   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | 001        |             | Jun         | 50            |                 |              |
            |            | 2020-05-16   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | 001        |             | Jerry       | 50            |                 |              |
            |            | 2020-05-20   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | 001        |             | Danny       | 50            |                 |              |
            |            | 2020-05-20   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | 002        |             | Jun         | 50            |                 |              |
            |            | 2020-05-25   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        |            |             | Jerry       | 50            |                 |              |
            |            | 2020-05-31   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | 001        |             | Jerry       | 50            |                 |              |
        Then 指定執行日期 2020-05-01，來源資料使用 DailyByMonthSelectedSource，檢查 Ic3ByDaily，每日數值
            | Date       | Value |
            | 2020-05-01 | 1     |
            | 2020-05-02 | 1     |
            | 2020-05-03 | 0     |
            | 2020-05-04 | 0     |
            | 2020-05-05 | 0     |
            | 2020-05-06 | 0     |
            | 2020-05-07 | 0     |
            | 2020-05-08 | 0     |
            | 2020-05-09 | 0     |
            | 2020-05-10 | 0     |
            | 2020-05-11 | 0     |
            | 2020-05-12 | 0     |
            | 2020-05-13 | 1     |
            | 2020-05-14 | 0     |
            | 2020-05-15 | 0     |
            | 2020-05-16 | 1     |
            | 2020-05-17 | 0     |
            | 2020-05-18 | 0     |
            | 2020-05-19 | 0     |
            | 2020-05-20 | 2     |
            | 2020-05-21 | 0     |
            | 2020-05-22 | 0     |
            | 2020-05-23 | 0     |
            | 2020-05-24 | 0     |
            | 2020-05-25 | 0     |
            | 2020-05-26 | 0     |
            | 2020-05-27 | 0     |
            | 2020-05-28 | 0     |
            | 2020-05-29 | 0     |
            | 2020-05-30 | 0     |
            | 2020-05-31 | 1     |

    Scenario: 計算IC3每日申報件數 (CardNumber為Prevention Code)
        Given 設定指標主體類型為醫師 Stan
        Given 設定病人 Jerry 24 歲
        Given 設定病人 Danny 24 歲
        Given 設定病人 Jun 24 歲
        When 設定指標資料
            | DisposalId | DisposalDate | ExamCode | ExamPoint | Code   | Point | OriginPoint | Tooth | Surface | SpecificCode | CardNumber | NhiCategory | PatientName | PartialBurden | PatientIdentity | SerialNumber |
            |            | 2020-05-01   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | IC001      |             | Jerry       | 50            |                 |              |
            | 1          | 2020-05-02   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | IC001      |             | Danny       | 50            |                 |              |
            | 1          | 2020-05-02   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | IC001      |             | Danny       | 50            |                 |              |
            |            | 2020-05-13   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | IC001      |             | Jun         | 50            |                 |              |
            |            | 2020-05-13   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | IC001      |             | Jun         | 50            |                 |              |
            |            | 2020-05-16   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | IC001      |             | Jerry       | 50            |                 |              |
            |            | 2020-05-20   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | IC001      |             | Danny       | 50            |                 |              |
            |            | 2020-05-20   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | IC002      |             | Jun         | 50            |                 |              |
            |            | 2020-05-25   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        |            |             | Jerry       | 50            |                 |              |
            |            | 2020-05-31   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | IC001      |             | Jerry       | 50            |                 |              |
        Then 指定執行日期 2020-05-01，來源資料使用 DailyByMonthSelectedSource，檢查 Ic3ByDaily，每日數值
            | Date       | Value |
            | 2020-05-01 | 1     |
            | 2020-05-02 | 1     |
            | 2020-05-03 | 0     |
            | 2020-05-04 | 0     |
            | 2020-05-05 | 0     |
            | 2020-05-06 | 0     |
            | 2020-05-07 | 0     |
            | 2020-05-08 | 0     |
            | 2020-05-09 | 0     |
            | 2020-05-10 | 0     |
            | 2020-05-11 | 0     |
            | 2020-05-12 | 0     |
            | 2020-05-13 | 2     |
            | 2020-05-14 | 0     |
            | 2020-05-15 | 0     |
            | 2020-05-16 | 1     |
            | 2020-05-17 | 0     |
            | 2020-05-18 | 0     |
            | 2020-05-19 | 0     |
            | 2020-05-20 | 2     |
            | 2020-05-21 | 0     |
            | 2020-05-22 | 0     |
            | 2020-05-23 | 0     |
            | 2020-05-24 | 0     |
            | 2020-05-25 | 0     |
            | 2020-05-26 | 0     |
            | 2020-05-27 | 0     |
            | 2020-05-28 | 0     |
            | 2020-05-29 | 0     |
            | 2020-05-30 | 0     |
            | 2020-05-31 | 1     |

    Scenario: 計算IC3每日申報件數 (CardNumber為Error Code)
        Given 設定指標主體類型為醫師 Stan
        Given 設定病人 Jerry 24 歲
        Given 設定病人 Danny 24 歲
        Given 設定病人 Jun 24 歲
        When 設定指標資料
            | DisposalId | DisposalDate | ExamCode | ExamPoint | Code   | Point | OriginPoint | Tooth | Surface | SpecificCode | CardNumber | NhiCategory | PatientName | PartialBurden | PatientIdentity | SerialNumber |
            |            | 2020-05-01   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | D001       |             | Jerry       | 50            |                 |              |
            | 1          | 2020-05-02   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | D001       |             | Danny       | 50            |                 |              |
            | 1          | 2020-05-02   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | D001       |             | Danny       | 50            |                 |              |
            |            | 2020-05-13   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | D001       |             | Jun         | 50            |                 |              |
            |            | 2020-05-13   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | D001       |             | Jun         | 50            |                 |              |
            |            | 2020-05-16   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | D001       |             | Jerry       | 50            |                 |              |
            |            | 2020-05-20   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | D001       |             | Danny       | 50            |                 |              |
            |            | 2020-05-20   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | D002       |             | Jun         | 50            |                 |              |
            |            | 2020-05-25   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        |            |             | Jerry       | 50            |                 |              |
            |            | 2020-05-31   | 00317C   | 635       | 89112C | 1050  | 1050        | 11    | MOD     | OTHER        | D001       |             | Jerry       | 50            |                 |              |
        Then 指定執行日期 2020-05-01，來源資料使用 DailyByMonthSelectedSource，檢查 Ic3ByDaily，每日數值
            | Date       | Value |
            | 2020-05-01 | 1     |
            | 2020-05-02 | 1     |
            | 2020-05-03 | 0     |
            | 2020-05-04 | 0     |
            | 2020-05-05 | 0     |
            | 2020-05-06 | 0     |
            | 2020-05-07 | 0     |
            | 2020-05-08 | 0     |
            | 2020-05-09 | 0     |
            | 2020-05-10 | 0     |
            | 2020-05-11 | 0     |
            | 2020-05-12 | 0     |
            | 2020-05-13 | 2     |
            | 2020-05-14 | 0     |
            | 2020-05-15 | 0     |
            | 2020-05-16 | 1     |
            | 2020-05-17 | 0     |
            | 2020-05-18 | 0     |
            | 2020-05-19 | 0     |
            | 2020-05-20 | 2     |
            | 2020-05-21 | 0     |
            | 2020-05-22 | 0     |
            | 2020-05-23 | 0     |
            | 2020-05-24 | 0     |
            | 2020-05-25 | 0     |
            | 2020-05-26 | 0     |
            | 2020-05-27 | 0     |
            | 2020-05-28 | 0     |
            | 2020-05-29 | 0     |
            | 2020-05-30 | 0     |
            | 2020-05-31 | 1     |
